#include <algorithm>
#include <iostream>
#include <iterator>

// Найти последний элемент не равный нулю и распечатать его индекс

int main(){
  const auto v = {4, 1, 3, 1, 2, 0, 1, 0, 4, 1, 0, 0, 0};

  if (...) {
    std::cout << "Last element is not 0 in v: " << std::distance(...) << '\n';
  } else {
    std::cout << "All elements aren't zero\n";
  }
}
