/*
 * найти максимальный и минимальный элемент по x 
 * и по y (отдельно) в векторе точек.
 */

#include <iostream>
#include <vector>

int main() {
  std::vector<double> v1 = {1,2,3};
  std::vector<double> v2 = {2,4,6};
  for(auto&& v : v1) {
    std::cout << v << ",";
  }
  std::cout << "\n";
  for(auto&& v : v2) {
    std::cout << v << ",";
  }
  std::cout << "\n";

////////////////////////////////////////////////
// разделить все элементы вектора v1 на элементы
// вектора  v2 почленно.   
  for_each(...);
////////////////////////////////////////////////  
  
  for(auto&& v : v1) {
    std::cout << v << ",";
  }
  std::cout << "\n";
  for(auto&& v : v2) {
    std::cout << v << ",";
  }
  std::cout << "\n";
}

/*
И распечатать внутри for_each. Вывод:
1,2,3,
2,4,6,
1/=2
2/=4
3/=6
0.5,0.5,0.5,
2,4,6,
*/